[
  {
    "id": "riftbound-origins-card-errata",
    "title": "Riftbound: Origins Card Errata",
    "content": "[[Download Card Errata]](https://cmsassets.rgpub.io/sanity/files/dsfx7636/news_live/5bcbb23cb6131680ec8d469de6c87a3966a7622d.pdf)\n\nHey Riftbounders! We’re sharing a recap of all the card errata for Riftbound: Origins. If you’re new to TCGs or Riftbound is your first TCG, card errata is any updates to card text usually for clarity and sometimes a goof like a typo. If you’re a seasoned TCG player, you might be already diving into the PDF above.\n\nWith Origins being our first set, it has more than its fair share of errata, most of it focused on rules clarity and consistency. We expect to issue very little “day zero” errata for future sets. Most of these card errata updates have already been shared through updates in our Core Rules FAQ, so there shouldn’t be too many surprises in there. A few cards that were in the FAQ have received slightly different wordings than previously announced, and there are three cards in this file that weren’t in the FAQ.\n\nThis is also a good time to reiterate our philosophy behind card errata. Changes from printed wordings add friction to your gameplay experience, and we don’t issue them lightly. And unlike a digital game, we don’t issue “patches” for game balance reasons. Where printed card wordings created unintended gameplay, were ambiguous about their function, or didn’t quite work in our updated rules, that’s where we’ve chosen to issue errata. The majority of the errata here doesn’t change how these cards work in regular gameplay situations; rather, it clarifies their function and shores it up against edge cases and rules oddities.\n\nWe’re heads down on the Riftbound: Origins English Launch (soonTM) and designing many sets to come, so give us some time as we work to update the Card Gallery or add another database resource to note the official language of the cards. Currently, card errata is not planned to be included on any future restocks of Riftbound: Origins or potential localizations of the cards. We’ll keep you all posted if that changes though!\n\nWith the recent update to Core Rules along with our Core Rules Patch Notes plus the final piece of the Trinity Force with the Card Errata, the Core Rules FAQ is now obsolete and will be retired on November 4, 2025.\n\nNow, that we have that out of the way, let’s dive into the Riftbound: Origins Card Errata:\n\n## Ava Achiever\n\n[NEW TEXT]\nWhen I attack, you may pay [C] to play a card with [Hidden] from your hand, ignoring its cost. If it’s a unit, play it here.\n\n#### ▲\n\n[OLD TEXT]\nWhen I attack, you may pay [C] to play a card with [Hidden] from your hand here, ignoring its cost.\n\n## Baited Hook\n\n[NEW TEXT]\n[1][C], [E]: Kill a friendly unit. Look at the top 5 cards of your Main Deck. You may banish a unit from among them that has Might up to 1 more than the killed unit and play it, ignoring its cost. Then recycle the rest.\n\n#### ▲\n\n[OLD TEXT]\n[1][C], [E]: Kill a friendly unit. Look at the top 5 cards of your Main Deck. You may play a unit from among them that has Might up to 1 more than the killed unit, ignoring its cost. Then recycle the rest.\n\n## Blind Fury\n\n[NEW TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nEach opponent reveals the top card of their Main Deck. Choose one and banish it, then play it, ignoring its cost. Then recycle the rest.\n\n#### ▲\n\n[OLD TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nEach opponent reveals the top card of their Main Deck. Choose one and play it, ignoring its cost. Then recycle the rest.\n\n## Clockwork Keeper\n\n[NEW TEXT]\nYou may pay [C] as an additional cost to play me.\n\nWhen you play me, if you paid the additional cost, draw 1.\n\n#### ▲\n\n[OLD TEXT]\nAs you play me, you may pay [C] as an additional cost. If you do, draw 1.\n\n## Convergent Mutation\n\n[NEW TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nChoose a friendly unit. This turn, increase its Might to the Might of another friendly unit.\n\n#### ▲\n\n[OLD TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nChoose a friendly unit. Increase its Might until it equals the Might of another friendly unit.\n\n## Dark Child, Starter\n\n[NEW TEXT]\nAt the end of your turn, ready up to 2 runes.\n\n#### ▲\n\n[OLD TEXT]\nAt the end of your turn, ready 2 runes.\n\n## Dazzling Aurora\n\n[NEW TEXT]\nAt the end of your turn, reveal cards from the top of your Main Deck until you reveal a unit and banish it. Play it, ignoring its cost, and recycle the rest.\n\n#### ▲\n\n[OLD TEXT]\nAt the end of your turn, reveal cards from the top of your Main Deck until you reveal a unit. Play it, ignoring its cost, and recycle the rest.\n\n## Disintegrate\n\n[NEW TEXT]\nAction (Play on your turn or in showdowns.)\n\nDeal 3 to a unit at a battlefield. If this kills it, do this: draw 1.\n\n#### ▲\n\n[OLD TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nDeal 3 to a unit at a battlefield. If this kills it, draw 1.\n\n## Dragon's Rage\n\n[NEW TEXT]\nMove an enemy unit. Then do this: Choose another enemy unit at its destination. They deal damage equal to their Mights to each other.\n\n#### ▲\n\n[OLD TEXT]\nMove an enemy unit. Then choose another enemy unit at its destination. They deal damage equal to their Mights to each other.\n\n## Dune Drake\n\n[NEW TEXT]\nWhen I attack, give me +2 [M] this turn if there is a ready enemy unit here.\n\n#### ▲\n\n[OLD TEXT]\nWhen I attack, give me +2 [M] if there is a ready enemy unit here.\n\n## Highlander\n\n[NEW TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nChoose a friendly unit. The next time it would die this turn, heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.)\n\n#### ▲\n\n[OLD TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nChoose a friendly unit. The next time it dies this turn, recall it exhausted instead. (Send it to base. This isn't a move.)\n\n## Karma, Channeler\n\n[NEW TEXT]\n[Vision] (When you play me, look at the top card of your Main Deck. You may recycle it.)\n\nWhen you recycle one or more cards to your Main Deck, buff a friendly unit. (If it doesn't have a buff, it gets a +1 [M] buff. Runes aren't cards.)\n\n#### ▲\n\n[OLD TEXT]\n[Vision] (When you play me, look at the top card of your Main Deck. You may recycle it.)\n\nWhen you recycle one or more cards, buff a friendly unit. (If it doesn't have a buff, it gets a +1 [M] buff. Runes aren't cards.)\n\n## Kinkou Monk\n\n[NEW TEXT]\nWhen you play me, buff up to two other friendly units. (Each one that doesn't have a buff gets a +1 [M] buff.)\n\n#### ▲\n\n[OLD TEXT]\nWhen you play me, buff two other friendly units. (Each one that doesn't have a buff gets a +1 [M] buff.)\n\n## Nocturne, Horrifying\n\n[NEW TEXT]\n[Ganking] (I can move from battlefield to battlefield.)\n\nAs you look at or reveal me from the top of your deck, you may banish me. If you do, you may play me for [A].\n\n#### ▲\n\n[OLD TEXT]\n[Ganking] (I can move from battlefield to battlefield.)\n\nWhen you look at cards from the top of your deck (and don't draw them) and see me, you may play me for [A].\n\n## Pack of Wonders\n\n[NEW TEXT]\n[E]: Return another friendly gear, unit, or facedown card to its owner's hand.\n\n#### ▲\n\n[OLD TEXT]\n[E]: Return another friendly gear, unit, or [Hidden] card to its owner's hand.\n\n## Portal Rescue\n\n[NEW TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nBanish a friendly unit, then its owner plays it to their base, ignoring its cost.\n\n#### ▲\n\n[OLD TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nBanish a friendly unit, then play it to base, ignoring its cost.\n\nNote: Text only differs for English version of the card\n\n## Promising Future\n\n[NEW TEXT]\nEach player looks at the top 5 cards of their Main Deck, banishes one of them, then recycles the rest. Starting with the next player, each player plays those cards, ignoring Energy costs. (They must still pay Power costs.)\n\n#### ▲\n\n[OLD TEXT]\nEach player looks at the top 5 cards of their Main Deck, chooses one, then recycles the rest. Starting with the next player, each player plays those cards, ignoring Energy costs. (They must still pay Power costs.)\n\n## Ravenborn Tome\n\n[NEW TEXT]\n[E]: The next spell you play this turn deals 1 Bonus Damage. (Each instance of damage the spell deals is increased by 1.)\n\n#### ▲\n\n[OLD TEXT]\n[E]: The next spell you play deals 1 Bonus Damage. (Each instance of damage the spell deals is increased by 1.)\n\n## Salvage\n\n[NEW TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nYou may kill up to one gear. Draw 1.\n\n#### ▲\n\n[OLD TEXT]\n[Action] (Play on your turn or in showdowns.)\n\nYou may kill a gear. Draw 1.\n\n## Sigil of the Storm\n\n[NEW TEXT]\nWhen you conquer here, you must recycle one of your runes. (This doesn’t choose anything.)\n\n#### ▲\n\n[OLD TEXT]\nWhen you conquer here, recycle one of your runes.\n\n## Sona, Harmonious\n\n[NEW TEXT]\nAt the end of your turn, if I'm at a battlefield, ready up to 4 friendly runes.\n\n#### ▲\n\n[OLD TEXT]\nWhile I'm at a battlefield, ready 4 friendly runes at the end of your turn.\n\n## Targon's Peak\n\n[NEW TEXT]\nWhen you conquer here, ready up to 2 runes at the end of this turn.\n\n#### ▲\n\n[OLD TEXT]\nWhen you conquer here, ready 2 runes at the end of this turn.\n\n## Teemo, Strategist\n\n[NEW TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen I defend, choose an enemy unit here and reveal the top 5 cards of your Main Deck. Deal 1 to that unit for each card with [Hidden] revealed this way, then recycle the revealed cards.\n\n#### ▲\n\n[OLD TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen I defend or I'm played from [Hidden], reveal the top 5 cards of your Main Deck. Deal 1 to an enemy unit here for each card with [Hidden], then recycle them.\n\n## The Boss\n\n[NEW TEXT]\nIf a buffed unit you control would die, you may pay [C], exhaust me, and spend its buff to heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.)\n\nWhen you conquer, ready me.\n\n#### ▲\n\n[OLD TEXT]\nWhen a buffed unit you control would die, you may pay [C] and exhaust me to spend its buff and recall it exhausted instead. (Send it to base. This isn't a move.)\n\nWhen you conquer, ready me.\n\n## The Dreaming Tree\n\n[NEW TEXT]\nWhen a player chooses a friendly unit here with a spell for the first time each turn, they draw 1.\n\n#### ▲\n\n[OLD TEXT]\nThe first time you choose a friendly unit with a spell here each turn, draw 1.\n\n## The Syren\n\n[NEW TEXT]\n[1], [E]: Move a friendly unit at a battlefield to its base.\n\n#### ▲\n\n[OLD TEXT]\n[1], [E]: Move a friendly unit at a battlefield to your base.\n\nNote: Text only differs for English version of the card\n\n## Tideturner\n\n[NEW TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play me, you may choose a unit you control at another location. Move me to its location and it to my original location.\n\n#### ▲\n\n[OLD TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play me, you may choose a friendly unit. Move me to its location and it to my original location.\n\n## Unforgiven\n\n[NEW TEXT]\n[2], [E]: Move a friendly unit to or from its base.\n\n#### ▲\n\n[OLD TEXT]\n[2], [E]: Move a friendly unit to or from your base.\n\nNote: Text only differs for English version of the card\n\n## Unlicensed Armory\n\n[NEW TEXT]\nDiscard 1, [E]: Choose a friendly unit. The next time it would die this turn, you may pay [C] to heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.)\n\n#### ▲\n\n[OLD TEXT]\nDiscard 1, [E]: Choose a friendly unit. The next time it dies this turn, you may pay [C] to recall it exhausted instead. (Send it to base. This isn't a move.)\n\n## Void Gate\n\n[NEW TEXT]\nSpells and abilities deal 1 Bonus Damage to units here. (Each instance of damage the spell deals to a unit here is increased by 1.)\n\n#### ▲\n\n[OLD TEXT]\nSpells and abilities affecting units here each deal 1 Bonus Damage. (Each instance of damage the spell deals is increased by 1.)\n\n## Zhonya's Hourglass\n\n[NEW TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nIf a friendly unit would die, kill this instead. Heal that unit, exhaust it, and recall it. (Send it to base. This isn't a move.)\n\n#### ▲\n\n[OLD TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nThe next time a friendly unit would die, kill this instead. Recall that unit exhausted. (Send it to base. This isn't a move.)",
    "source": "Riftbound Official",
    "publishedAt": "2025-10-28T01:00:00.000Z",
    "originUrl": "https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-origins-card-errata/",
    "updatedAt": "2026-02-18"
  },
  {
    "id": "riftbound-spiritforged-errata",
    "title": "Riftbound Spiritforged Errata",
    "content": "[[Download Card Errata]](https://cmsassets.rgpub.io/sanity/files/dsfx7636/news_live/44d1c3c1185a8360b290ddfbb1ba7f7aaae34e62.pdf)\n\nHey Riftbounders!\n\nWe’ve got some fresh card errata for you today, covering cards from both Origins and Spiritforged. If you’re just starting Riftbound, or new to TCGs, card errata refers to any updates to card text after a card was printed. We do this to make cards more easily understood and to clarify how they work within the rules of the game.\n\nYou can find the card errata in the above PDF, or in the text below. If you’re hungry for a deep dive into our philosophy about errata or why these changes were made, check out our [Riftbound Spiritforged FAQ](https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-spiritforged-faq), which goes into greater detail about these changes.\n\nOrigins Cards\nFalling Star\n[NEW TEXT] \nDeal 3 to a unit.\n\nDeal 3 to a unit.\n\n#### ▲\n\n[OLD TEXT]\nDo this twice:\n\nDeal 3 to a unit. (You can choose different units.)\n\nIcathian Rain\n[NEW TEXT] \nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\n#### ▲\n\n[OLD TEXT]\nDo this 6 times:\n\nDeal 2 to a unit. (You can choose different units.)\n\nReinforce\n[NEW TEXT] \nLook at the top 5 cards of your Main Deck. You may banish a unit from among them, then play it, reducing its cost by [5]. Recycle the remaining cards.\n\n#### ▲\n\n[OLD TEXT]\nLook at the top 5 cards of your Main Deck. You may play a unit from among them. Its Energy cost is reduced by [5]. Then recycle the remaining cards.\n\nSpiritforged Cards\nArise!\n[NEW TEXT] \nPlay a 2 [M] Sand Soldier unit token for each Equipment you control. Then do this: Ready up to two of them.\n\n#### ▲\n\n[OLD TEXT]\nPlay a 2 [M] Sand Soldier unit token for each Equipment you control. Then ready two of them.\n\nBlood Rush\n[NEW TEXT]\n[Action] (Play on your turn or in showdowns.)\n\n[Repeat] [1] (You may pay the additional cost to repeat this spell's effect.)\n\nGive a unit [Assault 2] this turn. (+2 [M] while it's an attacker.)\n\n#### ▲\n\n[OLD TEXT]\n[Action] (Play on your turn or in showdowns.)\n\n[Repeat] [1] (You may pay the additional cost to repeat this spell's effect.)\n\nGive a unit [Assault 2]. (+2 [M] while it's an attacker.)\n\nDeathgrip\n[NEW TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nKill a friendly unit. If you do, give +[M] equal to its Might to another friendly unit this turn.\n\nDraw 1.\n\n#### ▲\n\n[OLD TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nKill a friendly unit to give +[M] equal to its Might to another friendly unit this turn. Draw 1.\n\nEdge of Night\n[NEW TEXT]\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play this from face down, attach it to a unit you control (here).\n\n[Equip] [C] ([C]: Attach this to a unit you control.)\n\n#### ▲\n\n[OLD TEXT] \n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play this from face down, attach it to a unit you control here.\n\n[Equip] [C] ([C]: Attach this to a unit you control.)\n\nJanna, Savior\n[NEW TEXT]\n[Reaction] (Play any time, even before spells and abilities resolve, including to a battlefield you control.)\n\nWhen you play me, heal your units here, then move up to one enemy unit from here to its base.\n\n#### ▲\n\n[OLD TEXT] \n[Reaction] (Play any time, even before spells and abilities resolve, including to a battlefield you control.)\n\nWhen you play me, heal your units here, then move an enemy unit from here to its base.\n\nJax, Unmatched\n[NEW TEXT] \n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nYour Equipment everywhere have [Quick-Draw]. (Each gains [Reaction]. When you play it, attach it to a unit you control.)\n\n#### ▲\n\n[OLD TEXT]\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nEach Equipment in your hand has [Quick-Draw]. (It gains [Reaction]. When you play it, attach it to a unit you control.)\n\nKato the Arm\n[NEW TEXT] \n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhen I move to a battlefield, give another friendly unit my keywords and +[M] equal to my Might this turn.\n\n#### ▲\n\n[OLD TEXT]\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhen I move to a battlefield, give a friendly unit my keywords and +[M] equal to my Might this turn.\n\nRek’Sai, Swarm Queen\n[NEW TEXT] \nWhen I attack, you may reveal the top 2 cards of your Main Deck. You may banish one, then play it. If it is a unit, you may play it here. Recycle the rest.\n\n#### ▲\n\n[OLD TEXT]\nWhen I attack, you may reveal the top 2 cards of your Main Deck. You may play one. Then recycle the rest. If the played card is a unit, you may play it here.\n\nRell, Magnetic\n[NEW TEXT] \n[Tank] (I must be assigned combat damage first.)\n\nWhen I attack, you may play an Equipment with Energy cost no more than [2], ignoring its cost. If you do, then do this: Attach it to me.\n\n#### ▲\n\n[OLD TEXT]\n[Tank] (I must be assigned combat damage first.)\n\nWhen I attack, you may play an Equipment with Energy cost no more than [2], ignoring its cost, and attach it to me.\n\nTianna Crownguard\n[NEW TEXT] \n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhile I'm at a battlefield, opponents can't gain points.\n\n#### ▲\n\n[OLD TEXT]\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhile I'm at a battlefield, opponents can't score points.\n\nVoid Burrower\n[NEW TEXT] \nWhen you conquer, you may exhaust me to reveal the top 2 cards of your Main Deck. You may banish one, then play it. Recycle the rest.\n\n#### ▲\n\n[OLD TEXT]\nWhen you conquer, you may exhaust me to reveal the top 2 cards of your Main Deck. You may play one. Then recycle the rest.\n\nVoid Rush\n[NEW TEXT] \nReveal the top 2 cards of your Main Deck. You may banish one, then play it, reducing its cost by [2]. Draw any you didn't banish.\n\n#### ▲\n\n[OLD TEXT]\nReveal the top 2 cards of your Main Deck. You may play one of them, reducing its cost by [2]. Draw any you did not play this way.\n\nYone, Blademaster\n[NEW TEXT] \n[Weaponmaster] (When you play me, you may [Equip] one of your Equipment to me for [A] less, even if it's already attached.)\n\nWhen I conquer a battlefield that was uncontrolled, deal damage equal to my Might to an enemy unit in a base.\n\n#### ▲\n\n[OLD TEXT]\n[Weaponmaster] (When you play me, you may [Equip] one of your Equipment to me for [A] less, even if it's already attached.)\n\nWhen I conquer an open battlefield, deal damage equal to my Might to an enemy unit in a base.",
    "source": "Riftbound Official",
    "publishedAt": "2026-01-14T02:00:00.000Z",
    "originUrl": "https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-spiritforged-errata/",
    "updatedAt": "2026-02-18"
  }
]