[
  {
    "id": "riftbound-origins-faq",
    "title": "Riftbound Origins FAQ",
    "summary": "Scoring",
    "content": "## Scoring\n\n### Q: How do I score? How are conquer and hold different?\n\nWhen you take control of a battlefield you didnʼt already control and which you havenʼt scored yet this turn, you score 1 point. This is called conquering.\n\nIf you control a battlefield at the start of your turn, you score 1 point. This is called holding.\n\n### Q: How does the last point work?\n\nIn order to win the game, you need to score the last point (the 8th point in most games, 11th in 2v2). If you try to score the last point by conquering, you will only get the last point if you have already scored all of the other battlefields this turn. Otherwise, youʼll draw a card instead.\n\nSo, in an 8 point 1v1 game with two battlefields:\n\n- If you are at 6 points and conquer both battlefields, youʼll go to 7 and then to 8 and win.\n\n- If you are at 7 points and conquer both battlefields, youʼll draw a card for the first one, and then go to 8 and win.\n\n- If you are at 6 points, hold one battlefield to 7, and conquer the other to go to 8 and win.\n\nIf you are at 7 points, you can hold one to go to 8 and win. In an 8 point 4 player Free-for-All game with three battlefields:\n\n- If you are at 5 points and conquer all 3 battlefields, youʼll go to 6 then 7 then 8 and win.\n\n- If you are at 6 points and conquer all 3 battlefields, youʼll go to 7 then draw 1, then 8 and win.\n\n- If you are at 5 points, hold 1 battlefield to 6, then conquer the other two, youʼll go to 7 and then 8 and win.\n\n## Movement\n\n### Q: Whatʼs the standard move?\n\nEvery unit has the natural ability to move itself from base to battlefield, or back from battlefield to base, during your Main Phase (on your own turn, outside of a showdown). To do this, you pay the cost (exhausting the unit) and then move the unit. If a unit is exhausted, you canʼt move it using the standard move.\n\n### Q: Do I have to exhaust a unit when I move it with a spell or ability?\n\nMoving a unit with a spell or ability wonʼt change its ready or exhausted state unless the effect specifies that it does. The cost of using a unitʼs standard move is to exhaust that unit, but that isnʼt a cost or effect of other moves.\n\n### Q: Can I move multiple units together to a battlefield?\n\nYes, you can use the standard move of your units all at once to move them as a group together to the same legal destination. To do this, exhaust them all (the cost of the standard move) and then move them to the destination, then resolve any move effects, then start a showdown if needed.\n\n### Q: Does Ganking allow a unit to move an extra time? When can I use the Ganking ability?\n\nNo, Ganking is an extra way to use the standard move. Normally, when a unit uses the standard move, it can only move between base and battlefield. If a unit has Ganking, it can also move between two battlefields. You can move units with Ganking alongside other units that are moving with the standard move, as long as the destination is legal for all units moving as a group.\n\n### Q: Can I move more units in before a combat starts using a spell or ability?\n\nIf you donʼt move units together as a group using the standard move, then you can only move additional units afterward if you use a spell or ability with the Action or Reaction keywords, after the combat starts as part of the showdown.\n\n## Combat\n\n### Q: What happens when both sides in combat have the same total Might?\n\nIn this case, both sides will assign damage to the other side equal to the total Might of all units there, which will end up killing all units on both sides. No units will remain to control the battlefield, leaving it open and nobody will score a point.\n\n### Q: What happens if units from both sides in combat survive, either because of Kayn or a stun?\n\nIn this case, both sides will still assign damage to the other side as normal (stunned units will not deal damage). Units will still die if they are assigned damage equal to or greater than their Might (unless they donʼt die, for example because of Kaynʼs ability). Then if units from both sides remain alive at the battlefield, any remaining attacking units will be recalled to base and the defending player will maintain control (no score, though).\n\n### Q: Do units heal from combat damage? When?\n\nYes, units everywhere will heal from damage at the end of every combat and at the end of every turn. That means if a unit survives through damage assignment, itʼll be back to zero damage at the end of the combat.\n\n## Resources\n\n### Q: How do runes work? What are energy and power? Can I recycle an exhausted rune?\n\nYes, each rune has two abilities, and you can use both of them in the same turn:\n\n- You can exhaust a rune to produce 1 energy. Energy is used to pay numerical costs, and doesnʼt have a domain/color associated with it, even though the runes used to generate it do.\n\n- You can recycle a rune (even an exhausted one) to produce 1 power of that runeʼs domain/color. Power is used to pay color symbol costs.\n\nRune abilities have the Reaction keyword, which means they can be used anytime.\n\n### Q: Is there a limit to how many runes I can have?\n\nYes, all Riftbound decks are built with exactly 12 runes, so once you have channeled all of them, you canʼt get more runes on the board.\n\n### Q: Do Seals add energy? Do Seals enter exhausted like units do?\n\nNo, Seals canʼt generate energy. They can be exhausted to produce 1 power of Sealʼs domain/color. Since you donʼt recycle them to make the power resource, you will be able to ready them and use them again on future turns.\n\n### Q: How much do I pay for an Accelerate cost?\n\nAccelerate costs 1 energy and also 1 power of the unitʼs domain/color. Usually youʼll do this by taking an additional ready rune of the appropriate domain/color, exhaust it, and then recycle that same rune. For example, if a fury/red unit normally costs [3] (or 3 energy) and you want to accelerate it, its total cost would be [4][R] (or 4 energy and 1 power of the fury/red domain).\n\n## Keywords\n\n### Q: What does Mighty mean?\n\nA unit is Mighty if it has 5 or more Might. Units donʼt have the keyword “Mightyˮ—as long as a unit has 5 or more Might, the unit is Mighty. When you play a unit with 5 or more Might, you can exhaust your Relentless Storm Legend to channel a rune exhausted.\n\n### Q: Do I get my Legion effect when I play a token or use an ability?\n\nNo, Legion will only be active if youʼve played a card this turn. Tokens are not cards, and abilities arenʼt either.\n\n## Hidden\n\n### Q: How do I hide a card with Hidden?\n\nYou can hide a card with the Hidden keyword from your hand instead of paying its normal cost. To do this, you must already control a battlefield (have units there) to hide the card at. Hiding a card costs [A] (one power of any domain/color) and you place the card face down at that battlefield.\n\n### Q: When I hide a card, does that count for Legion?\n\nHiding isn't playing, and doesn't count as playing a card for abilities like Legion.\n\n### Q: If I hide a card, and then my opponent uses a spell to move a unit to that battlefield that same turn, can I play the card I hid?\n\nNo. You can't play cards the same turn you hide them.\n\n### Q: If I hid a card last turn, can I play that card even if Iʼm not reacting to another spell or ability?\n\nYou can play them any time you can normally play a reaction, which includes when you're not actually reacting to anything. You're not restricted to playing them during showdowns at their own battlefield.\n\n### Q: Do I have to play a unit I hid to that battlefield? Or can I play it to my base?\n\nA hidden unit must be played to that battlefield if able.\n\n### Q: If I play a spell with targets that I hid, do I have to choose those targets from the battlefield I hid it at?\n\nYes. If a hidden spell or a play effect of a hidden permanent chooses any targets, those targets must be chosen from among options at that battlefield, unless the ability explicitly restricts targeting in a way that makes this impossible. (Weʼll talk more about this later for specific cards.)\n\n### Q: If I play a card I hid, and that cardʼs effects include playing additional units (for example, tokens), can I play them anywhere?\n\nNo. If a hidden spell or a play effect of a hidden permanent causes you to play a unit, you must choose to have that unit enter the board at that battlefield.\n\n## Timing\n\n### Q: Can I use the exhaust ability of a unit in combat?\n\nThe cost of using an ability with the exhaust symbol is to exhaust that unit. If you just moved a unit into combat using the standard move, then you already exhausted the unit as the cost to do that, so you wonʼt be able to use its ability with the exhaust symbol that same turn. If the unit is defending, it might be ready and then you can use abilities that require exhausting it in combat (as long as those abilities have the Action or Reaction keyword).\n\n### Q: When can I use Viʼs ability to recycle cards from my trash to increase her Might?\n\nAbilities can only be used in your Main Phase, outside of a showdown, unless they have the Action or Reaction keyword. Viʼs ability does not, so it canʼt be used in combat/showdown.\n\n### Q: Can I use my Legend ability on my opponentʼs turn?\n\nAbilities can only be used in your Main Phase, outside of a showdown, unless they have the Action or Reaction keyword. Some Legends donʼt have these keywords, so those canʼt be used on an opponent's turn.\n\n### Q: I have a Reaction spell. Can I play it at the end of my opponentʼs turn?\n\nNo. The only time you can do this is if another ability triggers at the end of your opponentʼs turn, such as the Dark Child - Starter legend.\n\n### Q: In a free-for-all, can I play Actions and Reactions in a showdown that I donʼt have units at?\n\nYes. Starting with the player who contested control/the attack, players each get a chance to play an Action or Reaction. Other players can then react with Reactions, but once everyone passes, the next player in turn order can play their own Action or Reaction. Continue like this until all players have passed on an empty chain, and then move to the end of the showdown.\n\n## Miscellaneous\n\n### Q: Is there a maximum hand size?\n\nNo, you can have any number of cards in your hand.\n\n### Q: Is there a maximum number of units I can have in my base? On a battlefield?\n\nNo. You can have any number of units in a location.\n\n### Q: What happens when I run out of cards in my Main Deck?\n\nIf you run out of cards in your Main Deck, and then you need to draw 1, you will Burn Out. This means you take your Trash, recycle it into your deck, shuffle, and then choose an opponent to score 1 point.\n\nIf you have no Trash to recycle when you Burn Out, then youʼll grant an infinite number of points and pick an opponent to win the game.\n\n### Q: What happens when I run out of cards in my Rune Deck?\n\nNothing. You canʼt channel any more runes, but thereʼs no penalty beyond that.\n\n### Q: Do I put my Chosen Champion back in the Champion Zone when it leaves the board?\n\nNo. Once you play a Champion from your Champion Zone, it acts like any other card from your Main Deck. When it dies, it goes to the Trash.\n\n## Cards that Tell You Play Other Cards\n\n### Q: What happens when a card like The Harrowing instructs me to play another card during its resolution? Do I play it while the other spell or ability is still resolving? What if I can’t play it?\n\nTo clarify the timing of these and other effects, we’re introducing the idea of pending items on the chain. When you play a spell, or use an ability, they will be pending until you finish the steps of playing them before priority passes. When a spell or ability instructs you to play a card or play a token—or when a triggered ability has its trigger condition met—during the playing or resolution of another card or ability, you’ll perform the very first step of playing that card or using that ability by putting it on the chain, then stop. This chain item is still pending for now. You’ll then process the rest of whatever is currently happening, including putting any other pending items on the chain above it.\n\nThen, in the order the items were put on the chain, each pending item’s controller goes through the other steps of putting it on the chain: Make choices, pay costs, and evaluate legality. Only then is the pending item considered to have entered the chain. If it’s legal to play and it’s a unit or gear, it resolves immediately as usual. Once all pending items are done being fully added to the chain, play continues, and any items that remain on the chain can be reacted to. The most recent items to be placed on the chain will resolve first as usual.\n\nIf at any point during that process that player is unable to proceed with playing the pending chain item for any reason, the item is removed from the chain and, if it’s a card, is put back where it came from. This won’t happen very often—if you start the process of playing a card, you’ll almost always be able to legally finish it—but it’s a necessary failsafe to handle corner cases.\n\n### Q: What about cards like Blind Fury and Promising Future, which let players look at or reveal cards from the top of a deck, play one, and recycle the rest? If I can’t play that card, where does it go? It sounds like it’s too late for it to be recycled as part of “the rest.”\n\nHey, you’re pretty sharp! For most cards that let you play something, it’s easy to put the card back where it came from if you can’t play it. The Harrowing would put it back in your trash, Ava Achiever would put it back in your hand, and so on. But when the card came out of a deck, which is both secret and randomized, it’s not so simple.\n\nTo provide a clear and easy answer to this question, four cards in set 1 that let you play other cards from decks are receiving errata. They’ll each banish the card before instructing a player to play it. If the card can’t be played for any reason, it just stays banished. This is a small functional change, but it’s one we feel is well worth it to avoid the fuss of getting these cards back into a deck somehow.\n\n### Baited Hook\n\n[1][C], [E]: Kill a friendly unit. Look at the top 5 cards of your Main Deck. You may banish a unit from among them that has Might up to 1 more than the killed unit and play it, ignoring its cost. Then recycle the rest.\n\n### Blind Fury\n\n[Action] (Play on your turn or in showdowns.) Each opponent reveals the top card of their Main Deck. Choose one and banish it, then play it, ignoring its cost. Then recycle the rest.\n\n### Dazzling Aurora\n\nAt the end of your turn, reveal cards from the top of your Main Deck until you reveal a unit and banish it. Play it, ignoring its cost, and recycle the rest.\n\n### Promising Future\n\nEach player looks at the top 5 cards of their Main Deck, banishes one, then recycles the rest. Starting with the next player, each player plays those cards, ignoring Energy costs. (They must still pay Power costs.)\n\n### Q: So what exactly happens when someone plays Promising Future?\n\nStart with the player whose turn it is—probably Promising Future’s controller. That player looks at their top 5 cards, banishes one of them, and recycles the other 4. Then each other player in turn order repeats this process. Each player can see which cards the players before them have chosen. Then, starting with the next player in turn order this time, those players put the cards they chose onto the chain as pending items, with the player whose turn it is putting their item on the chain last.\n\nThen Promising Future finishes resolving, and the players finish adding their pending items to the chain in the same order they were put there, ignoring Energy costs but still paying Power costs. They must pay mandatory additional costs (like the cost of Cruel Patron), and may choose to pay optional additional costs (like Accelerate).\n\nEach card that’s a unit or gear resolves immediately, which may cause other things (such as play effects) to be added to the top of the chain as pending items. Any cards that can’t be played for any reason remain banished.\n\nOnce this process is done, any units or gear that were successfully played this way will be on the board, while spells chosen this way will all be on the chain in the same order they were put onto it. (This may result in spells that don’t have Action or Reaction being on the chain above other items, which is usually not possible. That’s fine.) Then, resolve the chain as normal.\n\n### Q: What about Nocturne? Doesn’t he also let you play a card from the top of a deck?\n\nGreat question! Nocturne is his own thing. Speaking of which…\n\n## Nocturne, Horrifying\n\n### Q: OK, so what about Nocturne? How does his ability work? Is it a triggered ability? Can I use it if I “reveal” him, or only if I “look at” him?\n\nNocturne has a few problems we’d like to address.\n\n- His ability is worded like a triggered ability (“when”), but it can’t really work like one. By the time a triggered ability could go on the chain, be reacted to, and resolve, you wouldn’t be looking at Nocturne anymore.\n\n- He has the same problem that the above cards do: you’re trying to play a card from a deck (in this case, Nocturne himself), and it’s hard to put him back there if you try to play him but can’t for some reason.\n\n- He is intended to be usable any time you’re looking at the front faces of cards from the top of your deck, whether the effect in question says to “look at” them or “reveal” them. The rules will be changed to clarify that last one—they will now explain that to “reveal” means the same thing as “allow all players to look at.”\n\nNocturne is receiving errata to solve these problems and bring him in line with his intended function. This errata makes it clear that this ability is not a triggered ability, and it uses banishment as a holding zone. It also specifies that revealing and looking both count; although we are handling that part at the rules level, we also want card text to reflect it unambiguously.\n\n### Nocturne, Horrifying\n\n[Ganking] (I can move from battlefield to battlefield.) As you look at or reveal me from the top of your deck, you may banish me. If you do, you may play me for [A].\n\n### Q: So how exactly does this ability work?\n\nThe process starts as you look at or reveal cards from the top of your Main Deck due to an effect. Let’s use Stacked Deck as an example. You play Stacked Deck and look at the top 3 cards of your deck. Nocturne is among them. You now get to choose whether to banish him or not. If you choose to banish him, you immediately begin the process of playing him from banishment, placing him on the chain as a pending item. Then you continue resolving Stacked Deck. There are only 2 cards left of the original 3; you’ll choose one to put into your hand and recycle the other one. Then, since Stacked Deck has finished resolving, you’ll finish the steps of putting Nocturne onto the chain from banishment, paying [A] (that’s one power of any type) instead of his base cost. As usual for units, he’ll resolve immediately and enter the board exhausted. If you weren’t able to play him for any reason, he’ll just stay banished.\n\n### Q: If I reveal multiple Nocturnes, can I play more than one? What if all 3 of the cards I look at for Stacked Deck are Nocturnes and I play all of them?\n\nYes, you can play more than one Nocturne at a time this way. If there aren’t any eligible cards left for the original effect you were resolving, any further instructions will be ignored. So if you reveal Stacked Deck, see 3 Nocturnes, and opt to banish and play all of them, you won’t put any cards into your hand, nor will you recycle any cards. You will, however, have 3 Nocturnes.\n\n### Q: So if Promising Future resolves and one or more players choose to banish Nocturne from the cards they looked at, what happens?\n\nAs you go around in turn order and each player looks at their top 5, they can choose to banish one or more Nocturnes before they banish a card with Promising Future. Any such Nocturnes will go on the chain as pending items before whatever that player chooses with Promising Future. They’ll remain pending through the whole process of resolving Promising Future, then at the appropriate point they’ll be fully placed on the chain and (because they’re units) will resolve immediately.\n\n### Q: What about Dazzling Aurora? If I reveal Nocturne, do I get to play him and keep going?\n\nNo, Dazzling Aurora stops when it finds Nocturne. Nocturne is revealed, then you may choose to banish him or not. If you banish him, you can play him for [A] using his own ability. If you don’t, you can play him for free using Dazzling Aurora’s ability (probably better, but you do you). Either way, you revealed a unit, so you don’t keep going.\n\n## Baited Hook\n\n### Q: What happens if I use an effect like Unlicensed Armory to prevent the death of the friendly unit I chose to kill with Baited Hook?\n\nBaited Hook kills a unit, then uses information about “the killed unit.” If you prevent that unit’s death, there’s no killed unit, so Baited Hook can’t evaluate its Might. As a result, the check for the Might of the “killed unit” returns a null value, and you’re not able to play any unit. If the unit is killed before the ability of Baited Hook resolves, the outcome is the same.\n\n## Convergent Mutation\n\n### Q: The English version of this card is missing “this turn,” but the Chinese version includes it. Which is correct?\n\nThe English version is a printing error. Convergent Mutation will receive errata to correct this oversight. Meanwhile, the Chinese version uses “becomes” language where the English version uses “increase.” We have opted to keep the “increase” wording from English, as these wordings work slightly differently\n\n### Convergent Mutation\n\n[Reaction] (Play any time, even before spells and abilities\nresolve.)\n\nChoose a friendly unit. This turn, increase its Might to the\nMight of another friendly unit.\n\n## Dune Drake\n\n### Q: What about Dune Drake? It’s missing “this turn” in both English and Chinese.\n\nThis is also a printing error, one that wasn’t caught in time to fix the Chinese version. It will also receive errata.\n\n### Dune Drake\n\nWhen I attack, give me +2 [M] this turn if there is a ready\nenemy unit here.\n\n## Ravenborn Tome\n\n### Q: Is Ravenborn Tome supposed to be able to grant bonus damage to spells I play on later turns?\n\nNo. This is another card that’s missing “this turn.”\n\n### Ravenborn Tome\n\n[E]: The next spell you play this turn deals 1 Bonus Damage.\n(Each instance of damage the spell deals is increased by\n1.)\n\n## Making Choices for Spells and Abilities (Targeting)\n\n### Q: Some spells and abilities require choosing units, gear, or other things for them to affect. The rules say some of these choices are made when I put the spell or ability on the chain, but it seems like some of them can’t be or shouldn’t be. How do I know the difference?\n\nRiftbound uses a set of contextual rules rather than specific words on cards to determine which choices are made as a card is played. When a spell or ability chooses something else to affect, the rules refer to those choices as “targets.” Targets must be chosen as the spell or ability is placed on the chain, and they must still meet all targeting requirements as the spell or ability resolves.\n\nThe next version of the rules will have more rigorous guidelines on which choices are targets, which we’ll summarize here. For the most part, these rules don’t change what choices are targets, they just spell it out more.\n\nAn object or player mentioned in a spell or ability is a target if all of the following are true:\n\n- something publicly visible to all players;\n\n- that you and you alone choose;\n\n- that isn’t part of a targeting restriction, cost, trigger condition, replacement effect, or an action that “must” be taken.\n\nThis explanation sounds complicated, but in general, most things that are affected by a spell or ability are targets. For a more precise breakdown of what each of those entails, see [the Appendix.](https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-origins-faq/#Appendix-Targeting)\n\nThere are two other choices that are not considered targets, but are made while putting something on the chain. Those are:\n\n- The location to which a unit will be played (normally either your base or a battlefield you control).\n\n- The destination or destinations for any spell or ability whose effect is moving one or more units, whether or not it mentions a destination by name.\n\n## Charm\n\n### Q: So as I play Charm, I have to say not only what unit I’m moving it, but where I’m moving it to?\n\nYes. This is a change from prior rulings. This means that move effects that don’t mention a destination (like Charm) work the same way as those that do (like Showstopper).\n\n### Q: What about when I use a unit’s standard move? Does that target?\n\nNo. The standard move is a special action that doesn’t use the chain and can’t be reacted to, so the concept of targeting doesn’t apply. You announce which units are moving and what destination they’re moving to, then move those units there immediately.\n\n## Spells with Multiple Targets\n\n### Q: If a spell has multiple targets, like Back to Back, do I need to choose targets for all of them to put the spell on the chain?\n\nYes. You must choose two different friendly units to play Back to Back, although it still resolves even if one or both of its targets are no longer valid when it resolves.\n\nThis is also true for activated abilities that have multiple targets.\n\n## Abilities with Multiple Targets\n\n### Q: What about triggered abilities with multiple targets, like Sona, Harmonious?\n\nThe same is true of triggered abilities with multiple targets. For triggered abilities, however, this causes some cards—Sona in particular—to work in unintended ways.\n\nGoing forward, we’ll put the words “up to” on most triggered abilities. In the meantime, several cards are receiving errata so that their triggered abilities behave intuitively.\n\n### Sona, Harmonious\n\nAt the end of your turn, if I'm at a battlefield, ready up to 4 friendly runes.\n\n### Targon's Peak\n\nWhen you conquer here, ready up to 2 runes at the end of this turn.\n\n### Dark Child - Starter\n\nAt the end of your turn, ready up to 2 runes.\n\n### Kinkou Monk\n\nWhen you play me, buff up to two other friendly units.\n\n(Each one that doesn't have a buff gets a +1 [M] buff.)\n\n## Sigil of the Storm\n\n### Q: Does Sigil of the Storm target? If it does, can I react to the trigger by recycling the chosen rune for Power? That seems weird.\n\nSigil of the Storm is receiving errata using a new wording to make sure that it doesnʼt target. This uses a new wording, “must,ˮ that indicates an action that must be taken. None of the choices made for such an ability are targets, and they are chosen as the ability resolves.\n\n### Sigil of the Storm (revised text)\n\nWhen you conquer here, you must recycle one of your runes.\n\n## Fox-Fire\n\n### Q: Are the units I choose for Fox-Fire targets? What happens if some of them gain Might as a reaction?\n\nFox-Fire is unusual (currently unique) in that its targets’ legality is evaluated as a group rather than individually. The updated rules will explain how to handle this.\n\nAs you play Fox-Fire, you’ll choose any number of units at a single battlefield whose current total Might is 4 or less. Then, after any appropriate Reactions, Fox-Fire resolves and checks target legality again. If the units no longer meet the group targeting restriction because some of them have gained Might, you choose any number of the original targets whose Might adds up to no more than 4.\n\nHere are a few examples to illustrate. In all of them, Fox-Fire initially chooses 4 Recruits with 1 Might each, and some of those Recruits have gained Might before Fox-Fire resolves.\n\n- One Recruit gets +1 Might. You can choose either to exclude that Recruit and kill the other three (total Might 3), or exclude one other Recruit and kill the 2 Might Recruit and two 1 Might Recruits (total Might 4).\n\n- One Recruit gets +3 Might. You can choose either to exclude that Recruit and kill the other three (total Might 3), or exclude the other three and kill just that one (total Might 4).\n\n- One Recruit gets +6 Might. You must choose to exclude that Recruit, because its Might alone takes you above your total. You must kill the other three (total Might 3).\n\n- Two Recruits get +1 Might. You can either kill the two 2 Might Recruits, or one 2 Might Recruit and the two 1 Might Recruits.\n\n- All four Recruits get +1 Might. You must choose two of the Recruits to kill, and the other two will survive.\n\n- All four Recruits get +3 Might. You choose one Recruit to kill (total Might 4) and exclude the rest.\n\n- All four Recruits get +6 Might. You no longer have a valid subset of targets, because even a single Recruit takes you over the Might limit. Fox-Fire does nothing.\n\n### Q: Does that mean if the units I originally chose die, move, or lose Might as a Reaction, I can pick additional units at that battlefield to kill?\n\nNo. You can only kill units from among the ones you initially chose.\n\n## Dragon’s Rage\n\n### Q: Dragon’s Rage also seems a little confusing under these targeting rules. What do I have to choose as I play it?\n\nDragon’s Rage works a little better now that move destinations are chosen at the same time as targets, but it’s still kind of strange. Accordingly, it will receive errata with a new template for “reflexive triggers”—triggered abilities within another spell or ability that create a new ability that goes on the chain separately from the original spell or ability. To show you what that looks like, here’s the updated text:\n\n### Dragon’s Rage\n\nMove an enemy unit. Then do this: Choose another enemy unit at its destination. They deal damage equal to their Mights to each other\n\nThat “do this” wording (or similar) tells you that what follows is a separate instruction from the original. As you start to play Dragon’s Rage, you only need to choose an enemy unit and a battlefield to move it to. Then, assuming Dragon’s Rage resolves, you’ll put a separate triggered ability on the chain, choosing another enemy unit at its destination (if one is available). That triggered ability can then be responded to separately. If there’s no enemy there, or if you didn’t actually move the unit you chose for any reason (and therefore there’s no “its destination” to reference), the trigger isn’t put on the chain at all.\n\nThis isn’t a tool we expect to use often, but it lets us make sure that cards like Dragon’s Rage offer chances for interaction and decision at points that feel appropriate.\n\n## Disintegrate\n\n### Q: How does Disintegrate work? Doesn’t the damage kill the unit after the spell has resolved?\n\nDisintegrate is a funny one—it looks like it works, but the more you understand the rules, the more it looks like it might not work after all. Units dealt lethal damage by a spell aren’t killed immediately, they’re killed right after that spell resolves. To solve this little rules conundrum, we’re using the new reflexive trigger wording here as well.\n\n### Disintegrate\n\nAction (Play on your turn or in showdowns.)\n\nDeal 3 to a unit at a battlefield. If this kills it, do this: draw 1.\n\n## Falling Star & Icathian Rain\n\n### Q: That “do this” wording is a lot like the one on Falling Star and Icathian Rain. Are those reflexive triggers too?\n\nYes! This means that these two spells no longer actually have any targets of their own—you play them with no choices. If they resolve, you then put each instance of their reflexive trigger on the chain separately, choosing the same or different units as you like. You’ll pay Deflect costs for each one as you put each trigger on the chain, and then the triggered abilities will resolve one at a time in the opposite order they were put on the chain. This is a big change to how those two cards work, but we think it actually matches how many people expected them to work when they first saw them.\n\n## Twisted Fate\n\n### Q: Twisted Fate too?\n\nYes, Twisted Fate’s “do one of the following” is also a reflexive trigger.\n\n## 2v2 and Friendly Units\n\n### Q: In 2v2, can my ally and I bring the same legend? What about the same battlefields?\n\nNo and no. The updated rules will clarify that you and your ally must bring different legends and different battlefields.\n\n### Q: When a card refers to a friendly unit, what does that mean?\n\nIn most games of Riftbound, “friendly [something]” means the same thing as “[something] you control.” In our 2v2 team format, however, “friendly” includes both things you control and things your ally controls.\n\n### Q: What about “your units?” Is that shared between teammates too?\n\nNo. “Your” refers exclusively to things you control (on the board or on the chain) or things you own (everywhere else). Your units are the units you control, your spells are the spells you play, your trash is the one where you put the cards you own, and so on.\n\n### Q: Can my ally and I share control of battlefields?\n\nNo, you and your ally can never have units at the same battlefield. A maximum of two players can have units at a battlefield. Those players must be opponents, and a combat will result.\n\n### Q: Can I move my ally’s unit to my own base with Unforgiven, the Yasuo legend? Does that mean it’s mine now?\n\nNo, you can’t do this. Any time you try to move something you don’t control into your base, it moves to its controller’s base instead. This is hard-coded in the rules, similar to how cards you own can ever be in your own hand, trash, or deck, even if something tries to put them in a different when. Similarly, you and your ally can never both have units at the same battlefield; the rules prevent any move that tries to make that happen.\n\nA few cards, including Unforgiven, were printed with English text that suggests misleading outcomes in these situations (but were printed correctly in Chinese). Those cards are receiving errata to clarify what they can and can’t do.\n\n### The Syren\n\n[1], [E]: Move a friendly unit at a battlefield to its base.\n\n### Unforgiven\n\n[2], [E]: Move a friendly unit to or from its base.\n\n### Portal Rescue\n\nBanish a friendly unit, then its owner plays it to their base, ignoring its cost.\n\nFor The Syren and Unforgiven, this is not functional errata, just a clarification. For Portal Rescue, this is a slight functional change to its interaction with cards like Possession. Previously, you could use Portal Rescue to re-play a card you took with Possession and retain control of it, but under the new wording this would give it back to its owner.\n\nAnother card, Tideturner, is receiving similar errata and another clarification (see below).\n\n## Cards with Hidden\n\n### Q: When you play a card from hidden, it gains several additional restrictions. The rules were somewhat unclear on this.\n\nThat’s not a question. But alright, let’s spell out the restrictions more clearly:\n\n- A hidden unit must be played to that battlefield if able.\n\n- If a hidden spell or a play effect of a hidden permanent chooses any targets, those targets must be chosen from among options at that battlefield, unless the ability explicitly restricts targeting in a way that makes this impossible. If a hidden spell or a play effect of a hidden permanent causes you to play a unit, you must choose to have that unit enter the board at that battlefield.\n\n## Tideturner\n\n### Q: What do the Hidden changes mean for Tideturner? It seems like I’m supposed to be able to choose a unit at another location.\n\nTideturner is receiving minor errata, both to restrict its targeting to a unit you control and to make sure that it can target a unit at another location under these rules.\n\n### Tideturner\n\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play me, you may choose a unit you control at another location. Move me to its location and it to my original location.\n\n## Zhonya’s Hourglass & Stand United\n\n### Q: What about Zhonya’s Hourglass and Stand United? When they’re played from hidden, are their effects restricted to the battlefield where they were played?\n\nOnly effects that choose are restricted. Zhonya’s Hourglass saves the next friendly unit that dies anywhere. Stand United can only give a buff to a unit at the battlefield where it was hidden, but its other effect, which causes buffs to grant an additional bonus, applies everywhere. This is a change from previous rulings on these cards, intended to simplify the question of what hidden cards can and can’t do.\n\nZhonya’s Hourglass has additional rulings and minor errata related to saving dying units; see below.\n\n## Ava Achiever\n\n### Q: Does Ava’s ability let me hide cards?\n\nNo, it lets you play cards with Hidden from your hand.\n\n### Q: What restrictions does Ava place on the card I play? What does “here” mean?\n\nAva’s restriction of “here” is meant to apply only to units. She will receive minor errata to make this clearer:\n\n### Ava Achiever\n\nWhen I attack, you may pay [C] to play a card with [Hidden] from your hand, ignoring its cost. If it’s a unit, play it here.\n\n## Pack of Wonders\n\n### Q: What can Pack of Wonders return to my hand?\n\nPack of Wonders can choose a friendly gear, a friendly unit, or a friendly facedown card hidden at a battlefield. It cannot return a card with the [Hidden] keyword from anywhere else, such as a player’s trash. To make that clearer, it’s receiving minor errata to say “facedown card” rather than “[Hidden] card.”\n\n### Pack of Wonders\n\n[E]: Return another friendly gear, unit, or facedown card to its owner's hand.\n\n### Q: Does this mean it can return a card from my deck to my hand? Those are face down…\n\nNo. (Nice try, though.) “Facedown card” always means a card that’s hidden facedown on the board unless a card’s text specifies otherwise.\n\n## Cards that Replace Units Dying\n\n### Q: When I replace a unit’s death with a card like Unlicensed Armory, does damage on the unit stay? If the unit died to lethal damage, doesn’t it just die again?\n\nThe intent behind these four cards is to save your unit from dying, whether it died due to direct kill like Hidden Blade or due to lethal damage. To better communicate this, these cards will receive updated wordings. Two of them, Highlander (from the Proving Grounds boxed set) and Unlicensed Armory, have straightforward fixes, adding “heal” and listing “exhaust” and “recall” as separate actions.\n\n### Highlander\n\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nChoose a friendly unit. The next time it dies this turn, heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.)\n\n### Unlicensed Armory\n\nDiscard 1, [E]: Choose a friendly unit. The next time it would die this turn, you may pay [C] to heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.)\n\nZhonya’s Hourglass also has a slightly updated wording making it clearer that its ability applies any time a friendly unit dies, not just on the turn you play it.\n\n### Zhonya’s Hourglass\n\n[Hidden] (Hide now for [A] to react with later for [0].) If a friendly unit would die, kill this instead. Heal that unit, exhaust it, and recall it. (Send it to base. This isn't a move.)\n\nThe Boss was mistakenly worded like a triggered ability. It’s receiving updated wording to make it clear that its ability is a replacement effect.\n\n### The Boss (revised text)\n\nIf a buffed unit you control would die, you may pay [C], exhaust me, and spend its buff to heal it, exhaust it, and recall it instead. (Send it to base. This isn't a move.) When you conquer, ready me.\n\n### Q: Can I use these cards to save a unit that’s already in its base? What about one that’s already exhausted? If I can’t recall it, do I still exhaust it?\n\nYes. You can save any unit that meets the description in the replacement ability’s condition. For Highlander and Unlicensed Armory, that’s any friendly unit. The actions you perform on that unit as a replacement are like the effects of a spell or ability; you’ll do as much as you can: heal the unit (if it’s damaged), exhaust it (if it’s ready), and recall it (if it’s somewhere other than its base). And yes, you exhaust the unit even if you don’t recall it; as per the above wordings, we’ve changed the “recall it exhausted” language to make that clearer.\n\n### Q: If I play Cruel Patron and kill one of my units for its additional cost, but one of these cards replaces that unit’s death, does the cost still count as paid?\n\nYes. You made the decision to pay the cost and took the action to pay it. What happened after that doesn’t matter.\n\n### Q: If a unit would be killed by Hidden Blade, but one of these cards replaces that unit’s death, does the unit’s controller still draw 2?\n\nYes. Hidden Blade attempts to kill a unit, then says that “its controller” draws 2. Even if the unit doesn’t die, it’s still on the board and information about its controller is still available, so that player draws 2. This is different from Baited Hook, which requests information about “the killed unit,” and can’t find any information if no unit was actually killed.\n\n## Timing of Healing Damage at End of Combat\n\n### Q: I have Garen, Commander at a battlefield along with a Recruit token. Thanks to Garen, the Recruit has 2 Might. My opponent’s total Might during the combat damage step is 6, so they deal 5 damage to Garen and 1 to the Recruit. Does the Recruit die?\n\nNo. Under the revised rules, combat damage is dealt, any units with lethal damage on them are killed, and then units are immediately healed of all damage before lethal damage is checked again.\n\nThis means that if one of your units that died was providing a Might boost to other units, they’re healed of any damage before losing that Might boost. This is a change from previous rulings that impacts cards including Captain Farron; Taric, Protector; Garen, Commander; and Darius, Executioner.\n\n### Q: Does the damage from Kog’Maw’s Deathknell ability happen before or after combat damage is healed?\n\nAfter. Kog’Maw, Caustic has a Deathknell ability that says “Deal 4 to all units at my battlefield.” Under the revised rules, all damage currently on units will be healed before Kog’Maw’s Deathknell ability resolves. This does mean, however, that any units that survive his Deathknell will still have 4 damage on them after combat, and you can use a spell or another combat to finish them off. This is a change from previous rulings..\n\n## Unyielding Spirit\n\n### Q: What counts as “spell and ability damage?” What does this card do?\n\n“Spell and ability damage” on Unyielding Spirit is meant to encompass damage dealt by spells and abilities, but not damage dealt by other things as a result of spells or abilities. It will receive errata to clarify this.\n\n### Unyielding Spirit\n\nPrevent all damage that would be dealt this turn by spells and abilities.\n\n### Q: So… What does this card do?\n\nMost spells and abilities that deal damage just say “Deal 3” or similar. Unyielding Spirit stops damage from all such spells and abilities. Other cards, though, specify a source of the damage.\n\n- Damage dealt by spells is damage that a spell instructs you to deal without specifying that some other object deals it.\n\n- Damage dealt by abilities is damage that an ability instructs you to deal without specifying that some other object deals it. (All damage dealt by abilities is also dealt by the object that's the source of the ability.)\n\nIf a spell or ability instructs a particular object to deal damage, including the card the ability is on, then that object is dealing the damage, not the spell or ability. So Unyielding Spirit does stop damage from Void Seeker, Stormbringer, or Yasuo, Remorseless, but does not stop damage from Challenge, Last Breath, or Carnivorous Snapvine.\n\n## Immortal Phoenix\n\n### Q: What does it mean to “kill a unit with a spell?” It seems like Hidden Blade counts, but what about a spell that deals damage? A spell that causes a unit to deal damage? A spell that causes a unit to die in some other way, like Stupefy on a unit that has 1 more Might than it has damage currently marked on it?\n\nThis is unclear under existing rules, so the updated rules will clarify. “When you kill a unit with a spell” triggers immediately after a spell you control resolves if either of the following is true:\n\n- That spell instructs you to kill a unit during its resolution, and that unit is put into the trash this way.\n\n- A spell instructs you to deal damage to a unit during its resolution, and that unit is put into the trash during the cleanup immediately following that spell’s resolution.\n\nThis includes “direct kill” spells you control like Hidden Blade. It also includes damage spells like Void Seeker, provided they mark lethal damage on the unit that immediately causes it to die. In all cases, the unit has to actually die—if that death is replaced by a card like Unlicensed Armory, then you didn’t kill a unit with a spell.\n\nNotably, the following do not count as you killing a unit with a spell:\n\n- You are instructed to kill a unit by a spell another player controls, even if the spell instructs you to kill\n        the unit (e.g., another player’s Cull the Weak).\n\n- Another player is instructed to kill a unit by a spell you control (e.g., your Cull the Weak, if you don’t kill\n        any of your own units with it).\n\n- You play a spell like Challenge that causes a unit to deal lethal damage to another unit.\n\n- You use a spell to mark damage on a unit and the unit dies later in the turn, even if that damage later became\n        lethal damage for any reason.\n\n- You use a spell to directly or indirectly lower the Might of a unit, causing damage it’s already taken to become\n        lethal damage. For example:\n\n- ○ You use a spell like Stupefy to lower the Might of a unit that has already taken damage, causing that\n                damage to become lethal damage.\n\n- You use a spell like Charm to move a unit with damage on it away from Trifarian War Camp, indirectly\n                lowering its Might and causing that damage to become lethal damage.\n\n- You use a spell like Rebuke to return Lee Sin, Centered to its owner’s hand, indirectly lowering the\n                Might of a buffed unit at the same battlefield that has damage on it, causing that damage to become\n                lethal damage.\n\n- You do anything else with a spell that causes a unit to die in any other way than the two methods listed above,\n        or at any time other than during or immediately after the spell’s resolution.\n\n- You do any of the above, but the unit doesn’t actually die.\n\n### Q: Can Immortal Phoenix return if it is the unit that was killed? Or if it and other units were killed at the same time? For example, can I Hidden Blade on my own Phoenix and immediately replay it?\n\nYes. Triggers like this are evaluated immediately after the event that takes place, at which point Phoenix is in the trash.\n\n## Void Gate\n\n### Q: If a spell deals damage to one or more units at Void Gate and one or more units somewhere else, which parts of that deal Bonus Damage?\n\nThe Bonus Damage from Void Gate is only for damage being dealt to units at Void Gate. It will receive errata to clarify this. (As a bonus, Bonus Damage will now be fully defined in the rules.)\n\n### Void Gate (revised text)\n\nSpells and abilities deal 1 Bonus Damage to units here.\n\n(Each instance of damage the spell deals to a unit here is increased by 1.)\n\n## Darius, Trifarian\n\n### Q: If I play Darius, Trifarian as my second card in a turn, does he ready and gain 2 Might?\n\nYes, this works. Triggers like this are evaluated immediately after the event that takes place, at which point Darius is on the board.\n\n### Q: If I play Darius as my third card, does he ready and gain 2 Might? What if I play another card after him?\n\nNo. If Darius isn’t present immediately after you play your second card, he won’t trigger that turn.\n\n## Hallowed Tomb\n\n### Q: Can this card only return the specific card I picked as my Chosen Champion? What about another copy of the same card?\n\nYou can return another copy of the same card. Hallowed Tomb refers to “your Chosen Champion,” but it’s quite possible that you won’t be able to verify whether a card in your trash is the specific card you chose. For example, your Chosen Champion might have been played, returned to your hand, and then discarded; you wouldn’t be able to prove to your opponent that it wasn’t another copy of the same card. Because of this, the updated rules treat all copies of the card you designated as your Chosen Champion as interchangeable.\n\n### Q: What about a different card with the same Champion tag? If Jinx, Rebel is my Chosen Champion, can I get back a Jinx, Demolitionist, because Jinx is my Chosen Champion?\n\nNo. You can only get back a card with the exact full card name of the one you chose at the start of the game.\n\n## Karma, Channeler\n\n### Q: Does Karma trigger off of recycling runes?\n\nNo. When the text of Riftbound cards refers to “cards,” it means Main Deck cards only. Karma’s reminder text reflects this.\n\n### Q: Does Karma trigger off of recycling cards into other players’ Main Deck due to a card like Sabotage?\n\nNo. The updated rules will clarify that regardless of who is instructed to do the recycling in card text, players always recycle their own cards. To reflect this, Karma is receiving errata.\n\n### Karma, Channeler (revised text)\n\n[Vision] (When you play me, look at the top card of your Main Deck. You may recycle it.)\n\nWhen you recycle one or more cards to your Main Deck, buff a friendly unit. (If it doesn't have a buff, it gets a +1 [M] buff.)\n\n## Sun Disc\n\n### Q: Can I use Sun Disc’s ability the turn I play it, counting itself for its Legion ability?\n\nYes. Although Legion normally requires “another” card for spells and play effects, Sun Disc’s activated ability is not Sun Disc. On subsequent turns, you’ll need to play another card to turn on Legion.\n\n## Symbol of the Solari\n\n### Q: What does it mean for combat to be a “tie?”\n\nThe updated rules will more clearly define what it means to win, lose, or tie a combat.\n\n- A player wins a combat if only their units are present after combat damage has been dealt.\n\n-\n        A player loses a combat if the other player in combat still has units present and they do not (ie, if the\n            other player wins).\n\n-\n        A combat ends in a tie if either:\n\n-\n                Neither player has units left at the battlefield (e.g. they all died to combat damage).\n\n-\n                Both players have units left at the battlefield (e.g. one or more units was ineligible to deal or\n                    receive combat damage—stunned units, Kayn, etc).\n\nWinning a combat is not the same as conquering, although ordinarily the attacking player must win in order to\n    conquer. Either the attacker or the defender can win, and each combat either ends in a tie, or has exactly one\n    winner and one loser.\n\nWhen combat ends in a tie, all attacking units are recalled to their base and the defender retains control of the\n    battlefield. This doesn’t cause the defender to win the combat; it’s too late for that.\n\n### Q: Does Symbol of the Solari recall all units everywhere?\n\nNo, just the units that were involved in the tie. It’s receiving minor errata to clarify this.\n\n### Symbol of the Solari\n\nIf a combat where you are the attacker ends in a tie that would recall any of your units, recall all units at that battlefield instead. (Send them to base. This isn't a move. Ties are calculated after combat damage is dealt.)\n\n### Q: So what does Symbol of the Solari do?\n\nSymbol of the Solari has a replacement effect that applies to a combat if 1) you are the attacker, and 2) the combat ends in a tie because both players have units remaining. Ordinarily this would result in your units being recalled and the defender retaining control, but Symbol of the Solari instead causes all units at that battlefield to be recalled, leaving the battlefield open and uncontested.\n\n## Teemo, Strategist\n\n### Q: What does this card do, and when can it do it? If I play him from Hidden during combat, does his ability trigger twice?\n\nWe’re issuing a rules update that changes how Teemo and other defend and attack triggers work, and we’re issuing a minor errata for Teemo in accordance with it. We’re also clarifying what his ability does and how many targets it has. This contradicts some previous guidance we’ve given on this card, as we’ve examined what it says, what it’s intended to do, and what our rules can support.\n\nTeemo has a “when I defend” trigger. Under previous rules, attack and defend triggers happened only at the beginning of combat. Teemo’s dual trigger condition was meant to cover this—he either triggered at the beginning of combat, or he triggered when you played him into combat.\n\n### Teemo, Strategist (revised text)\n\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen I defend, choose an enemy unit here and reveal the top 5 cards of your Main Deck. Deal 1 to that unit for each card with [Hidden] revealed this way, then recycle the revealed cards.\n\nUnder the updated rules, attack and defend triggers trigger any time a unit becomes an attacker or defender—whether that’s because combat began, because the unit was moved into combat using a spell or ability, or because the unit was played into combat somehow. (And yes, this means that a unit that starts in combat, moves out somehow, and then moves back can trigger these abilities twice. We think this is fine—moving a unit at Action speed isn’t easy to do, and doing it twice is even harder, so we don’t mind there being a substantial reward.)\n\nOne thing to note about this change that doesn’t apply to Teemo directly: Assault and Shield are not attack or defend triggers, so they’ll work the same way they did before. They apply while a unit is an attacker or defender in combat as appropriate, stop applying once the unit is no longer in combat, and start applying if it joins or rejoins combat partway through. This rules change makes the “played from [Hidden]” part of Teemo’s text redundant. And since the ability only does anything if enemy units are present, we’re issuing errata to clarify that it only triggers once as intended, whether Teemo is played into combat or was there from the start. We’re also rephrasing the ability to make it clearer that it only has one target.\n\n### Q: How many enemy units do I target with Teemo, and when do I choose them?\n\nTeemo has only a single target, an enemy unit, chosen when his triggered ability is placed on the chain. That ability will deal a variable amount of damage to that unit based on how many units with Hidden you reveal. This is a change from previous rulings.\n\n### Q: Which cards count for Teemo? Does Ember Monk count? What about Noxus Saboteur?\n\nTeemo counts cards that have the Hidden keyword, but not cards that mention Hidden but don’t actually have it. Ember Monk and Noxus Saboteur do not have the Hidden keyword.\n\n## Wraith of Echoes\n\n### Q: Does Wraith of Echoes trigger on its own death?\n\nNo. Units don’t “see” themselves die unless they have an ability such as Deathknell that explicitly allows them to. For clarity, we are issuing an errata that adds the word “another” to Wraith of Echoes.\n\n### Wraith of Echoes\n\nThe first time another friendly unit dies each turn, draw 1.\n\n### Q: What about other units that die at the same time as Wraith of Echoes, such as to a mass damage spell like Unchecked Power?\n\nNo. Units that die also don’t “see” anything else that dies at the same time they do.\n\n### Q: What happens if the first time a unit dies in a turn is actually two or more units dying simultaneously? Does it trigger twice?\n\nJust once. If an ability triggers “the first time” something happens and that trigger condition is met multiple times simultaneously, you’ll pick one to count as the first.",
    "source": "Riftbound Official",
    "publishedAt": "2025-10-16T19:00:00.000Z",
    "originUrl": "https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-origins-faq/",
    "updatedAt": "2026-02-18"
  },
  {
    "id": "riftbound-spiritforged-faq",
    "title": "Riftbound Spiritforged FAQ",
    "summary": "Hi all! We’ve heard your questions about Spiritforged, and we’d like to address some of them. We also need to issue some clarifications of intent where the curr",
    "content": "Hi all! We’ve heard your questions about Spiritforged, and we’d like to address some of them. We also need to issue some clarifications of intent where the current version of the Core Rules is ambiguous or misleading. These clarifications will be incorporated into the next iteration of the Core Rules.\n\nAs part of these revised and clarified rulings, we have also updated some card wordings (this is called errata). We previously announced plans to issue errata via a database called Watcher. These plans are still in the works, and we’ll update you when we can!\n\nThis document has three sections:\n\n- Outstanding Issues from the Origins FAQ, including some errata to Origins and Spiritforged cards\n\n- Functional Errata for a small number of other cards in Spiritforged \n\n- Rules Clarifications about cards whose intended function may not be obvious in the current rules\n\nThe errata are also available as a separate document.\n\nThis FAQ includes far fewer errata and rules revisions than the Origins FAQ, but it still includes more than we’d like. The reason for this lies in part with the long lead times for physical games. Spiritforged card text was already finalized when many of the rules and templating decisions in the Origins FAQ and errata were made, so some of this is just catching up. We expect the need for “day 0” errata to (continue to) decrease as our rules stabilize and our production catches up to the real world.\n\nWe’re well aware that the formatting and cadence of our rules guidance have room for improvement, and we’re committed to making those improvements in the coming months. For now, though, we wanted to get clarifications and errata into players’ hands in time for Chinese tournaments with Spiritforged cards. These clarifications take effect immediately.\n\nOne other note about errata, as always: Errata may impact the effective power level of cards, but we have no plans to issue errata strictly for power level reasons—only to make cards work within the rules and as intended.\n\nThroughout this document, we use some specific shorthand to represent symbols in card text. Here’s a short guide:\n\n- [E] means “exhaust”\n- [M] means “Might”\n- [A] means “one power of any domain”\n- [C] means “one power of this card’s domain”\n- [C] in Accelerate costs takes on the domain of the unit, or turns into [A] if the unit has no domain or multiple domains.\n- [C] in other cases is treated as the corresponding power symbol in all respects, matching how the cards are actually printed—it’s just a design shorthand!Origins FAQ Outstanding Issues and ErrataSome categories of errata that we made in the Origins FAQ also apply to Spiritforged cards, but weren’t made in time to be included in their printed versions. We’ve also got a few loose ends in Origins to tie up.\n\n#### Falling Star, Icathian Rain, and Deflect\nThe Origins FAQ impacted these two Origins cards in ways that ultimately went beyond our original intentions for them, and we haven’t been happy with the result. We’ll turn over the mic to Riftbound Game Director Dave Guskin to talk about two prominent Origins cards that are receiving errata:\n\nHey all, Dave here! As we developed more and more designs that needed to perform effects after an initial effect resolved, we added in a new type of trigger called a reflexive trigger. These triggers are the way that a spell or ability can use information from a first effect, and still allow other players to respond now knowing that information before the second effect resolves.\n\nWe used a straightforward template (or formal wording) to identify reflexive triggers, the \"then do this:\" template. And because Icathian Rain and Falling Star were already using a similar template, I ended up pushing forward with changing those cards to reflexive triggers even though they didn't have a first effect -> information -> second effect kind of flow.\n\nThis was a mistake, and we shouldn't have done this—it has a lot of weird unintuitive consequences for gameplay that make these two cards play different than one might expect, and also worse.\n\nFor those reasons, we're changing these two cards to work the way other spells work and the way we think players want them to work—that is, you pick all the targets up front, the other player can react before any of it resolves, and then each of the units affected take the damage on resolution. You can still choose the same unit or different units for each choice.\n\nFalling Star (revised text)\n\nDeal 3 to a unit.\n\nDeal 3 to a unit.\n\n(You can choose different units.)\n\nIcathian Rain (revised text)\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\nDeal 2 to a unit.\n\n(You can choose different units.)\n\nIn addition to these card changes, we have a small rules change to make. We’ve realized that our design team and rules team weren’t in agreement about how Deflect was supposed to work. In the rules, a target’s Deflect cost was paid once for each spell or ability. In the design team’s playtesting, it was paid once for each time that target was chosen. That misalignment didn’t actually matter—Icathian Rain and Falling Star had reflexive triggers, so they worked as intended, and there were no other cards (that we could find) that can choose the same unit multiple times. Now that difference does matter, both because of the above errata and the existence of the Repeat ability, and we want the cards to play as the design team intended. To that end, we’re taking the unusual step of issuing errata for the rules themselves:\n\nRule 735.1.c (revised text)\n\nIt is functionally short for \"Spells and abilities an opponent controls that choose me cost an amount of Power equal to [Deflect Value] more to play as an additional cost for each time they choose me.\"\n\nCards that Tell You to Play Other Cards from Your Deck\n\nQ: Origins cards that instruct players to play cards from their deck, like Promising Future and Blind Fury, received errata to banish those cards before playing them. Will Spiritforged cards with similar abilities receive similar errata?\n\nYes! This is mostly a bookkeeping thing—banishing the card ensures that the game has a place to put the card until it’s actually played, and a place to send the card back to if it can’t be played for whatever reason. 99% of the time, these cards work the same with or without this errata, but we need to cover those weird corner cases. This impacts 3 Spiritforged cards, plus 1 Origins card that got past us last time.\n\nRek’Sai, Swarm Queen (revised text)\n\nWhen I attack, you may reveal the top 2 cards of your Main Deck. You may banish one, then play it. If it is a unit, you may play it here. Recycle the rest.\n\nVoid Burrower (revised text)\n\nWhen you conquer, you may exhaust me to reveal the top 2 cards of your Main Deck. You may banish one, then play it. Recycle the rest. \n\nVoid Rush (revised text)\n\nReveal the top 2 cards of your Main Deck. You may banish one, then play it, reducing its cost by [2]. Draw any you didn't banish. \n\nReinforce (revised text)\n\nLook at the top 5 cards of your Main Deck. You may banish a unit from among them, then play it, reducing its cost by [5]. Recycle the remaining cards.\n\nReflexive Triggers on Spiritforged Cards\n\nQ: Should the reflexive trigger system introduced in the Origins FAQ apply to any cards in Spiritforged?\n\nYes! This is another one where if you don’t know the finer points of the rules, you’re probably already playing these cards correctly, but the machinery of the rules requires a slightly different wording than we thought. Reflexive triggers, identified by “do this:” language, create new chain items to handle things that need to offer players a chance to react, or just need to happen later than the rest of a spell or ability. This impacts 2 cards in Spiritforged, both of which let you play something and then try to do something to that thing.\n\nArise! (revised text)\n\nPlay a 2 [M] Sand Soldier unit token for each Equipment you control. Then do this: Ready up to two of them. \n\nRell, Magnetic (revised text)\n\nTank (I must be assigned combat damage first.)\n\nWhen I attack, you may play an Equipment with Energy cost no more than [2], ignoring its cost. If you do, then do this: Attach it to me.\n\nSpiritforged Functional ErrataA handful of cards in Spiritforged were printed with text that either doesn’t quite work, or technically works but goes against design intent and (we think) common sense. We’re issuing errata to maintain these cards’ intended function.\n\nBlood Rush\n\nQ: Should Blood Rush say “this turn” on it?\n\nIt should! Like Convergent Mutation in Origins, the phrase “this turn” was accidentally omitted.\n\nBlood Rush (revised text)\n\n[Action] (Play on your turn or in showdowns.)\n\n[Repeat][1] (You may pay the additional cost to repeat this spell's effect.)\n\nGive a unit [Assault 2] this turn. (+2 [M] while it's an attacker.)\n\nDeathgrip\n\nQ: Is the first friendly unit on Deathgrip a cost or a target? When do I kill it, and what happens if I don’t?\n\nDeathgrip uses a nonstandard wording that we normally avoid, precisely because of these ambiguities. We’re issuing errata to bring it more in line with how other cards and abilities work. This errata establishes that 1) the friendly unit is a target, not a cost; 2) it is chosen along with the other friendly unit and killed as the spell resolves; 3) if you don’t actually kill it for any reason, either because it’s no longer a legal target or because you replaced its death with an effect like Zhonya’s Hourglass, you do not give the second friendly unit any Might. (You do still draw 1; we’ve introduced a paragraph break to make that clear.)\n\nDeathgrip (revised text)\n\n[Reaction] (Play any time, even before spells and abilities resolve.)\n\nKill a friendly unit. If you do, give +[M] equal to its Might to another friendly unit this turn.\n\nDraw 1.\n\nEdge of Night\n\nQ: Does Edge of Night’s auto-attach ability work?\n\nBecause unattended gear at battlefields are recalled, Edge of Night does a strange little dance on its way to becoming attached, returning to your base while its ability is on the chain. And because of that dance, it’s no longer “here” when the attachment is supposed to happen. We need to change its wording so it can still find the unit you chose.\n\nBut we don’t want any confusion here—the card works exactly the same as it did before. The Hidden rules still require that you choose a unit at the battlefield where you played it from face down. For that reason, we’ve included reminder text in the errata.\n\nEdge of Night (revised text)\n\n[Hidden] (Hide now for [A] to react with later for [0].)\n\nWhen you play this from face down, attach it to a unit you control (here).\n\n[Equip] [C] ([C]: Attach this to a unit you control.)\n\nJanna, Savior\n\nQ: Can Janna’s play effect be used to heal my units without an enemy unit present?\n\nTriggered abilities in Riftbound can’t be placed on the chain unless all required targets can be chosen. They can resolve and perform part of their text without all targets still being available, but all targets must be available to put them on the chain to begin with. This is weird, and we generally try not to force players to know it. We think 99% of players probably expect that Janna can heal their units without enemies present, so we’re meeting that expectation with a simple “up to,” similar to some “up to” errata for triggered abilities in Origins.\n\nJanna, Savior (revised text)\n\n[Reaction] (Play any time, even before spells and abilities resolve, including to a battlefield you control.)\n\nWhen you play me, heal your units here, then move up to one enemy unit from here to its base.\n\nJax, Unmatched\n\nQ: How does Jax, Unmatched work?\n\nJax, Unmatched grants Quick-Draw to Equipment in your hand, which works as far as letting you play them as Reactions… but doesn’t work so well when the Equipment hits the board and the other part of Quick-Draw tries to take effect. We’re fixing that.\n\nJax, Unmatched (revised text)\n\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nYour Equipment everywhere have [Quick-Draw]. (Each gains [Reaction]. When you play it, attach it to a unit you control.)\n\nKato the Arm\n\nQ: Can Kato the Arm give himself his own Might and keywords?\n\n“Friendly unit” does properly include Kato himself, but that wasn’t the intent behind this card—Kato can’t throw himself, after all. It was a simple goof that Kato made it out the door without the word “another,” and the gameplay is so divergent from the design intent that we’re changing it to fix this error.\n\nKato the Arm (revised text)\n\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhen I move to a battlefield, give another friendly unit my keywords and +[M] equal to my Might this turn.\n\nQ: Does Kato give keywords he’s gained during play? What about Might bonuses from various sources like Equipment?\n\nYes. Kato gives his current keywords and additional Might equal to his current Might to the unit you choose. Later changes to Kato don’t matter; what the unit gets is locked in as the ability resolves.\n\nTianna Crownguard\n\nQ: Can I still conquer and hold battlefields while my opponent has Tianna? Do I get conquer and hold triggers? What about drawing a card instead of getting the 8th point from conquering?\n\nRiftbound rules and card text use the word “score” in a couple different ways. You can score battlefields; you can also score points, as on cards like Tryndamere, Barbarian. The difference between these two is usually clear… but Tianna muddles them more than we anticipated. Tianna is solely concerned with points and doesn’t interfere with the process of conquering or holding battlefields. You can still conquer and hold battlefields and get your conquer and hold triggers. You can even draw a card if you conquer a battlefield and can’t score because it’s the final point and you haven’t scored every battlefield yet. It’s not until you reach for your scorepad, app, or tracking die that Tianna says “No.”\n\nThe “gain points” meaning of score is underdeveloped in the current rules, so in the future we are likely to revisit the rules and/or card wordings for scoring points without scoring battlefields. For now, we’re issuing errata to make Tianna’s function clearer and leaving the rest unchanged.\n\nTianna Crownguard (revised text)\n\n[Deflect] (Opponents must pay [A] to choose me with a spell or ability.)\n\nWhile I'm at a battlefield, opponents can't gain points.\n\nQ: Does Forgotten Monument work the same as Tianna? Will it receive similar errata?\n\nForgotten Monument works differently from Tianna, and we agree that’s confusing. That’s part of why we decided to issue errata for Tianna (and not for Forgotten Monument).\n\nForgotten Monument completely prevents the process of scoring there. That means no conquer triggers, no hold triggers, and no points from doing those things. “Extra” points such as those from Renata Glasc, Mastermind are unaffected. You can still gain control of the battlefield following a showdown—you just can’t conquer it.\n\nYone, Blademaster\n\nQ: When and how does Yone trigger? If you conquer a battlefield, is it still open?\n\nYone’s current text is a little, well, open to interpretation. A strict reading suggests that he can never trigger at all—once you’ve conquered a battlefield, it’s no longer open—but obviously that’s not the intent. We’re tweaking his text to cue off the control status of the battlefield immediately before conquering it. This means that he works as intended, triggering at the end of a noncombat showdown in which he conquers. It also means that he now triggers in “surprise defense” scenarios, caused when units move around during showdowns and you wind up defending a battlefield you don’t control.\n\nYone, Blademaster (revised text)\n\n[Weaponmaster] (When you play me, you may [Equip] one of your Equipment to me for [A] less, even if it's already attached.)\n\nWhen I conquer a battlefield that was uncontrolled, deal damage equal to my Might to an enemy unit in a base.\n\nRules ClarificationsThere are a few cards in Spiritforged whose function isn’t entirely clear, not because of anything wrong with their text, but because the rules don’t support them as well as they should. A future rules update will fix these oversights, but in the meantime, we’d like to offer guidance on how these cards should be played.\n\nDraven, Audacious\n\nQ: What does it mean to win or lose a combat?\n\nWinning and losing combats is a system that was inadvertently left out of the most recent rules update. Here are the conditions under which you win, lose, or tie a combat.\n\nAfter combat damage has been dealt:\n\n- If neither player has units remaining at the battlefield or both players have units remaining, combat is a tie. If both players do, attackers are recalled.\n\n- If only one player has units remaining at the battlefield, that player wins the combat and the other player loses. Draven triggers if he’s among the units that survive.\n\nIt doesn’t matter whether combat damage was actually dealt, only that there was a combat showdown and only your units were left after combat damage. If you killed or removed all the opposing units with spells and abilities before Draven had to throw any punches, he still wins. (Think of it as winning by default.)\n\nYou can win a combat on either offense or defense.\n\nQ: If I win on the attack and conquer, does this happen before or after I score? Before or after conquer effects?\n\nDraven’s ability will trigger and resolve before you gain your regular point for scoring the battlefield and before any conquer effects are triggered. This means that you can’t win from 6 points by conquering a battlefield with Draven without having scored all other battlefields—you’ll gain your point from Draven, then the game will see that you’re at 7 points and give you a card draw instead of a point for conquering.\n\nPickpocket\n\nQ: Can Pickpocket kill a Gold token?\n\nYes, but we see why you’d ask. The rules use a “NULL” system for values that aren’t available, such as the Might of a unit that’s been removed from the board. The unit is gone and the information is missing, so you can’t do any calculations or comparisons with it (not even “is it no more than 1?”).\n\nThat system could reasonably be applied to the costs of tokens, but we feel that results in unintuitive situations, like not being able to kill a Gold token with Pickpocket. After all, the token’s not missing; it just doesn’t have a cost because it doesn’t need one. We’ll be updating the rules to clarify that the cost of a token can be treated as 0 for all purposes.\n\nRumble, Hotheaded\n\nQ: Can Rumble, Hotheaded choose a Mech token to recycle? If he does, where does it go?\n\nYes, he can. This is a minor gap in the rules. Main Deck cards are recycled to the Main Deck and runes are recycled to the Rune deck, but tokens aren’t actually either of those things. We’ll be clarifying in a future rules updates that tokens “inherit” the recycle destination of their type(s), so a token that’s a unit or gear is recycled to your Main Deck just like any other gear. It then vanishes, as tokens do any time they leave the board, but it still counts as “the unit you recycled” and Rumble can check its Might.\n\nSvellsongur\n\nQ: Does Svellsongur copy text that the unit has gained from other sources, such as the Assault granted by Cleave? What about text it’s gained from other Equipment?\n\nNo, Svellsongur only copies the text that’s actually printed on the unit. This is an ambiguity in the current rules, which refer to “appending” and “removing” rules text without reference to whether that text is original to the unit or not.\n\nThe key word here is actually copy, a system that will be fleshed out in a future rules update. For now, we’ll just tell you that copies of objects or text take on their original traits, without regard to any subsequent alterations.\n\nSvellsongur doesn’t grant the unit additional “copies” of the abilities of other Equipment. So putting 3 Svellsongur on the same unit will give that unit four total instances of its abilities, not eight. (Four should be plenty.)\n\nQ: Aphelios, Exalted has an ability that triggers when I attach an Equipment to him and tells me to “choose one that hasn’t been chosen this turn.” If I attach Svellsongur to him, does he have the second copy of his ability in time for both to trigger? And do I have to choose different options?\n\nHe does have the second copy of his ability in time, and it will trigger. The “one that hasn’t been chosen this turn” restriction applies separately to each instance of his ability. So you could choose the same option for both, but you’ll have to track which options you’ve used for each copy of his ability.\n\nCards that Reduce Might\n\nQ: I heard that cards that reduce Might will no longer say “to a minimum of 1” on them. Does that mean Origins cards like Stupefy will receive errata?\n\nNo. This is a change to our design philosophy beginning with Spiritforged, but Origins cards will maintain their functionality.\n\nQ: Does this mean that units’ Might can go to 0 or below now?\n\nUnits’ Might could always go to 0 or below; it was just really hard to actually make it happen. For example: If a Recruit was at Trifarian War Camp, it would have 2 Might (its 1 base Might, +1 from War Camp). If it got hit with Stupefy, Stupefy would “snapshot” at -1 Might, reducing the Recruit’s Might to 1. If the Recruit then moved away from Trifarian War Camp, it would lose the +1 Might bonus and end up at 0 Might. It’s much easier to make it happen with Spiritforged cards, though, so it’s worth reviewing the rules for units with 0 or less Might.\n\nQ: Does a unit with 0 or less Might automatically die?\n\nNo, units can stick around on the board with 0 (or less!) Might. They will die if they take any damage, but “0” is not a valid amount of damage, so it takes 1 damage to kill a unit with 0 or less Might. We realize that this is a little weird, but it’s important to us that cards like Frigid Touch can’t be used to actually kill units, only weaken them.\n\nQ: Does a unit with negative Might contribute negative damage to my Might total in combat?\n\nNo. Negative Might is treated as 0 Might for the purposes of dealing damage, but as its true value for raising it back above 0. So a unit with -3 Might would contribute 0 damage in combat, would die if it was dealt 1 or more damage, and would require +4 Might to get it back up to 1 Might.\n\nEzreal, Prodigy\n\nQ: What costs does Ezreal, Prodigy reduce? Does he reduce Repeat costs? Accelerate costs? Equip costs?\n\nEzreal, Prodigy reduces additional costs that are optional to pay. These will generally use both the words “additional cost” and the word “may.” Repeat and Accelerate are the two main sources of optional additional costs, but Ezreal can also offer a discount for one-off oddballs like Blast Corps Cadet.\n\nEzreal can’t reduce Equip costs. That’s an activation cost for an ability, so it’s neither optional nor additional. There aren’t currently any optional additional costs that apply to activating abilities.\n\nQ: What about Deflect costs? Aren’t those optional now?\n\nNo, Ezreal won’t help with Deflect costs, and Deflect is not optional. Deflect is a mandatory additional cost, meaning you must pay it if you want to finalize a spell or ability that chooses something with Deflect. It’s true that you can choose not to pay Deflect costs for triggered abilities by choosing not to finalize them, but that doesn’t make it an optional cost.\n\nHostile Takeover\n\nQ: If I use Hostile Takeover to take control of my opponent’s only unit at a battlefield, will there be a showdown? Will it be a combat?\n\nYou’ll start a noncombat showdown. (Hostile Takeover’s reminder text is a little misleading in this regard—you have to have some kind of showdown before you can conquer.) This ruling applies any time you have a unit at a battlefield when your opponent still controls that battlefield, but doesn’t have any units there. (Yes, that can happen. Hostile Takeover and Stormbringer are the easiest ways to do it.)\n\nThere’s a gap in the current rules that leaves this situation without an obvious outcome. We plan to address that gap in the next regular rules update. The issue is surprisingly complex, and we’re not 100% sure what the answer will be when we’re done.\n\nIn the meantime, though, we believe starting a noncombat showdown is the least disruptive way to handle this scenario. If you need really precise timing: assume that your opponent loses control of the battlefield in the same cleanup that begins the showdown, even though ordinarily control is “frozen” once the battlefield becomes contested.\n\nTemporal Portal\n\nQ: What parts of a spell does the Repeat ability cause to be repeated? Is it the entire effect? If I use Temporal Portal to give Find Your Center Repeat and pay the cost while its cost reduction applies, does the cost reduction happen once or twice, and does the final spell cost 2 or 4?\n\nRepeat causes you to repeat execution of a spell’s “instructions,” which are the things the spell tells you to do as it resolves. (We’ll give a better definition of “instructions” and how to define them in an upcoming rules update.) And the Repeat cost of Find Your Center isn’t reduced, even when its base cost is, because anything that asks for a card’s cost finds its printed cost as the answer.\n\nThis means that Find Your Center’s cost reduction applies only once and the final spell costs 4—its base cost of 3, plus its Repeat cost of 3, minus its cost reduction of 2.\n\nCards with Weaponmaster\n\nQ: The reminder text of Weaponmaster says “You may”, but the Core Rules reads like it is mandatory. Which is it?\n\nOh, sharp catch. Weaponmaster as a keyword is always meant to be optional. While the rules utilize a language structure that imply a mandatory target, the reminder text is more accurate here. It is always a choice on whether or not to use this play ability. We will clean up that language in the future.",
    "source": "Riftbound Official",
    "publishedAt": "2026-01-14T02:00:00.000Z",
    "originUrl": "https://riftbound.leagueoflegends.com/en-us/news/rules-and-releases/riftbound-spiritforged-faq/",
    "updatedAt": "2026-02-18"
  }
]